//26

#include <stdio.h>
#include <math.h>
//d o u b e loglp (doube х) ; Возвращает log (1 + х) (С99)


int main(void){
    double ln;
    printf("Программа выводит Y = ln(X+1) с шагом X в 1 \n");
    for(float x = 0.0; x <= 5.0; x++){
        ln = log1p(x);
        printf("Номер итерации: %d X: %f Y: %lf\n", (int)x+1, x, ln);
    }

    return 0;
}

/*в моём варианте проблем с тем, что счётчик вещественный нет, но если взять вариант 13, где шаг 0.2, уже могут 
начаться проблемы с тем, что 0.2 невозможно точно написать в двоичной системе,
следовательно 0.2 будет лишь округлением бесконечной дроби, что может негативно сказаться на правильности
счётчика*/