//21
//1 / (i**2 + 1) 
#include <stdio.h>

int main(void){
    double sum = 0.0;
    int N;
    double f;
    printf("Введите N: \n");
    while (scanf("%d", &N) != 0 & N > 0){
        //printf("%d\n",N);
        for(int i = 1; i <= N; i++){

            f = (1.0 / ((i * i) + 1.0));
            sum += f;
            //printf("%d %lf \n", i, f);
        }

        printf("%.6lf \n", sum);
        sum = 0.0;

        printf("Введите N: \n");

    }
    
    return 0;
}
//пример вывода в задаче не верный, проверено на питоне
//нужно инициализорать вещественным нулём, потому что иначе при суммировании будут отсекаться знаки после запятой, что
//по условию задачи неправильно
